Revit 2027 API
Outline(Outline) Constructor
 Constructs a new copy of the input Outline object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Outline(
	Outline other
)
Public Sub New (
	other As Outline
)
public:
Outline(
	Outline^ other
)
new :
        other : Outline -> Outline
Parameters
other Outline
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Outline Class
Outline Overload
Autodesk.Revit.DB Namespace